#define _CRT_SECURE_NO_WARNINGS
//学习篇：数据存储_数据类型：整形存储和大小端
//#include <stdio.h>
//int main()
//{
//	int i = 0; 
//		int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//		printf("%p\n", arr);//debug和release的地址不同
//		printf("%p\n", &i);
//		for (i = 0; i <= 12; i++)
//		{
//			arr[i] = 0;
//			printf("hehe\n");
//		}
//	return 0;
//}
#include <stdio.h>
//整数二进制有
//源码，直接二进制序列
//反码，符号位不变其他取反
//补码，反码+1
//正整数，源反补相同
//负整数，反码-1；取反换算源码
//补码+1取反==源码
//源码取反加一==补码
int main()
{
	int a = 20;
	//源码00000000000000000000000000010100
	//16进制0x80 00 00 14
	int b = -10;
	//源码00000000000000000000000000001010
	//0x80 00 00 0a
	//反码11111111111111111111111111110101
	//0xfffffff5
	//补码11111111111111111111111111110110
	//0xfffffff6
	//cpu只有加法器所以数据存储都是补码
	//例如1-1==1+（-1）
	//0000000000000000000000000000001+1000000000000000000000000000001=10000000000000000000000000000000//33位去掉最高位=0
	return 0;
}