#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
////浮点数的存储
//int main()
//{
//	int n = 9;
//	float* pfloat = (float*)&n;
//	printf("n的值%d\n", n);
//	printf("pfloat的值%f\n", *pfloat);//以浮点数的形式读取n的值//以浮点数打印整数9的二进制表示形式00000000000000000000000000001001==E=00000000是一个趋近于0的非常小的数
//	*pfloat = 9.0;
//	printf("n的值%d\n", n);//以整数的形式读取pfloat的值//以整形打印浮点数9.0的二进制表示形式0100000001001000000000000000000000==首位为0正数不需要转码直接打印
//	printf("pfloat的值%f\n", *pfloat);
//	return 0;
//}
//v=9.5=1001.1==9.5后面的.1表示一个2的-1次方科学计数法=1.0011*2^3==  (-1)^0*1.0011*2^3   //S=0 M=1.0011 E=3//S表示符号位S=0为正S=1为负数 M表示尾数 E表示指数部分
//v=9.6//=1001.1001100110011001100110011001100110011001100110011001100110011....找不到可以精确表示9.6的二进制小数，所以只能用一个近似值来表示9.6所以浮点数有精度误差
//float可以存放32bit位而double可以存放64bit位所以double的精度要高于float
//32位float一位是S八位是E二十三位是M
//64位double一位是S十一位是E五十二位是M
//IEEE规定计算机保存M时默认这个数的第一位总是1因此可以舍去只保存后面列如1.01=01读取时再加上1//这样可以节省一位给M精度会更高一些
//E存放时是无符号整数，但有些情况下E会是负数，，所以存放时E要加上一个中间数，对于八位的E这个中间数是127对于十一位的E这个中间数是1023
//列5.5=s=0 M=1.011 E=2  E存放时2+127=129=10000001=0 1000001 01100000000000000000000000//M存放只存小数点后的后面不够补0取出时再加上1
//E取出E不为全0和全1时再减去127得到真正的E
//E为全0  E=1-127（1-1023）有效数字M也不再加1而是还原为0.xxxx这种形式表示的数非常小
//E为全1这时如果有效数字M全0表示±无穷大
//#include <stdio.h>
////牛牛的替换
//int main()
//{
//    int a = 0;
//    scanf("%d ", &a);
//    char add[a];
//    int i = 0;
//    char a1 = 0;
//    char a2 = 0;
//    char a3 = 0;
//    char a4 = 0;
//    //输入更换的字符
//    scanf(" %c %c %c %c ", &a1, &a2, &a3, &a4);
//    for (i = 0; i < a; i++)
//    {
//        scanf("%c", &add[i]);
//    }
//    for (i = 0; i < a; i++)
//    {
//        if (add[i] == a1)
//        {
//            add[i] = a2;
//        }
//    }
//    for (i = 0; i < a; i++)
//    {
//        if (add[i] == a3)
//        {
//            add[i] = a4;
//        }
//        printf("%c", add[i]);
//    }
//    return 0;
//}
#include <stdio.h>
#include <math.h>
//找最大不是完全平方数
int pfs(int n, int* p)//函数题所以调用函数
{
    int i = 0;
    int max = 0;
    for (i = 0; i < n; i++)
    {
        //获得整数与原数相比//sqrt返回的是double相等就是完全平方数
        int b = (int)sqrt(*p);
        if (b != sqrt(*p) && max < (*p))
        {
            //获得最大的完全平方数
            max = (*p);
        }
        p++;
    }
    return max;
}
int main()
{
    int n = 0;
    scanf("%d ", &n);
    int add[n];
    int i = 0;
    for (i = 0; i < n; i++)
    {
        scanf("%d ", &add[i]);
    }
    printf("%d", pfs(n, add));
    return 0;
}